; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-14)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room6)
(at ball12 room6)
(at ball13 room6)
(at ball14 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 0 of 14
2. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 0 of 14
3. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 1 of 14
4. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 1 of 14
5. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 1 of 14
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 1 of 14
7. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 2 of 14
8. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 2 of 14
9. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 2 of 14
10. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 2 of 14
11. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 3 of 14
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 3 of 14
13. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 3 of 14
14. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 3 of 14
15. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 3 of 14
16. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 4 of 14
17. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 4 of 14
18. (pick ball14 room6 left)
   deleted: (at ball14 room6) (free left)
   added: (carry ball14 left)
   goals met: 4 of 14
19. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 4 of 14
20. (drop ball14 room4 left)
   deleted: (carry ball14 left)
   added: (at ball14 room4) (free left)
   goals met: 5 of 14
21. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 5 of 14
22. (pick ball13 room6 left)
   deleted: (at ball13 room6) (free left)
   added: (carry ball13 left)
   goals met: 5 of 14
23. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 5 of 14
24. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 6 of 14
25. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 6 of 14
26. (pick ball12 room6 left)
   deleted: (at ball12 room6) (free left)
   added: (carry ball12 left)
   goals met: 6 of 14
27. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 6 of 14
28. (drop ball12 room4 left)
   deleted: (carry ball12 left)
   added: (at ball12 room4) (free left)
   goals met: 7 of 14
29. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 7 of 14
30. (pick ball11 room6 left)
   deleted: (at ball11 room6) (free left)
   added: (carry ball11 left)
   goals met: 7 of 14
31. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 7 of 14
32. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 7 of 14
33. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 8 of 14
34. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 8 of 14
35. (pick ball9 room5 left)
   deleted: (at ball9 room5) (free left)
   added: (carry ball9 left)
   goals met: 8 of 14
36. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 8 of 14
37. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 9 of 14
38. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 9 of 14
39. (pick ball8 room5 left)
   deleted: (at ball8 room5) (free left)
   added: (carry ball8 left)
   goals met: 9 of 14
40. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 9 of 14
41. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 10 of 14
42. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 10 of 14
43. (pick ball7 room5 left)
   deleted: (at ball7 room5) (free left)
   added: (carry ball7 left)
   goals met: 10 of 14
44. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 10 of 14
45. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 11 of 14
46. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 11 of 14
47. (pick ball10 room5 left)
   deleted: (at ball10 room5) (free left)
   added: (carry ball10 left)
   goals met: 11 of 14
48. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 11 of 14
49. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 12 of 14
50. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 14
51. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 12 of 14
52. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 14
53. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 13 of 14
54. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 13 of 14
55. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 13 of 14
56. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 14
57. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 14 of 14
